OpenFoam/validation1rod/fvDOM/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    LeftWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          16000;
        startFace       31720;
    }
    RightWedge
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          16000;
        startFace       47720;
    }
    Inlet
    {
        type            patch;
        nFaces          80;
        startFace       63720;
    }
    Outlet
    {
        type            patch;
        nFaces          80;
        startFace       63800;
    }
    Outterwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       63880;
    }
    Innerwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       64080;
    }
)

// ************************************************************************* //
