OpenFoam/validation1rod/fvDOM/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.7;

boundaryField
{   
    Inlet       { type fixedValue; value uniform 293.7; }
    
    Innerwall     
    {
        type            externalWallHeatFluxTemperature;
        kappa           fluidThermo;
        q               uniform 3636;
        value           uniform 293.7;
        kappaName       none;
        Qr              Qr;
    }
  
    Outlet      { type zeroGradient; }
    Outterwall  { type zeroGradient; }
    LeftWedge   { type wedge; }
    RightWedge  { type wedge; }
}

// ************************************************************************* //
